# Infrastructure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisciplineTypeId..::..Infrastructure Property
DisciplineTypeId Class See Also
---
Infrastructure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static ForgeTypeId Infrastructure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Infrastructure As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Infrastructure {
	ForgeTypeId^ get ();
}
```

# See Also
DisciplineTypeId Class
Autodesk.Revit.DB Namespace